# Вывести на экран числа от -N до N
N = int(input('Введите число N = '))
i = -N
while i< N:
    print(i)
    i=i+1
