# Задайте последовательность чисел.
# Напишите программу, которая выведет список неповторяющихся элементов исходной последовательности.

numList = [1, 3, 1, 4, 2, 2, 3, 5, 3, 4, 6, 4, 5, 7, 5, 6, 1, 6, 6, 7, 5, 7]
numSet = set(numList)
print(numSet)
